<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--
	EL : out.println()
	
	연산자
		산술연산자(+,-,*,/,%)
			순수 산술처리만 가능(+ : 문자열 결합 불가능)
			"10" : 자동으로 Integer.parseInt()
				${10+10}	=	20
				${10+"10"}	=	20	-	정수변경
				${null+10}	=	10	-	자동으로 0대체
				${10+= "10"}	=	1010	-	문자열 결합
			- / : 정수/정수는 실수
				${5/2} = ${5 div 2}
			% : 나머지
				${5%2} = ${5 mod 2} = 1
		비교연산자(==, !=, <, >, <=, >=)
			숫자, 문자열, 날짜 가능. true/false	
		논리연산자 : &&(범위/기간 포함. and), ||(범위/기간 아닌경우. or), 
			두개의 조건 처리
		삼항연산자 : if, else, if~else
			조건이 true면 값1, false면 값2
--%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<h1>산술연산자 EL</h1>
<%-- 		
		&#36;{10+10}=${10+10} }<br>
		&#36;{10+"10"=${10+"10" }<br>
		&#36;{null+10}=${null+10 }<br>
		&#36;{10+= "10"}=${10+= "10"}<br>
		<%// &#36;{10+= "10"}=${10+= "10 "} %>
		<%//"숫자"에 공백시 오류 %>
		&#36;{5/2}=${5/2 }<br>
		&#36;{5 div 2}=${5 div 2 }<br>
		<%//정수 나누기 정수는 실수로 출력 %>
		&#36;{5%2}=${5%2 }<br>
		&#36;{5 mod 2}=${5 mod 2 }<br> 
--%>

<%-- 
	&#36;{10==10 }=${10==10 }<br>
	&#36;{10 eq 10 }=${10 eq 10 }<br>
	&#36;{10!=10 }=${10!=10 }<br>
	&#36;{10 ne 10 }=${10 ne 10 }<br>
	&#36;{10<10 }=${10<10 }<br>
	&#36;{10 lt 10 }=${10 lt 10 }<br>
	&#36;{10>10 }=${10>10 }<br>
	&#36;{10 gt 10 }=${10 gt 10 }<br>
	&#36;{10<=10 }=${10<=10 }<br>
	&#36;{10 le 10 }=${10 le 10 }<br>
	&#36;{10>=10 }=${10>=10 }<br>
	&#36;{10 ge 10 }=${10 ge 10 }<br>
	<%
		/*
			/	=	div
			%	=	mod
			&&	=	and
			||	=	or
		*/
	%>

	&#36;{"홍길동"=="심청이"}=${"홍길동"=="심청이"}<%//문자비교가능. 가나다순 비교 %><br>
	&#36;{"홍길동"eq"심청이"}=${"홍길동"eq"심청이"}<br>
	&#36;{"홍길동"!="심청이"}=${"홍길동"!="심청이"}<br>
	&#36;{"홍길동"ne"심청이"}=${"홍길동"ne"심청이"}<br>
	&#36;{"홍길동"<"심청이"}=${"홍길동"<"심청이"}<br>
	&#36;{"홍길동"lt"심청이"}=${"홍길동"lt"심청이"}<br>
	&#36;{"홍길동">"심청이"}=${"홍길동">"심청이"}<br>
	&#36;{"홍길동"gt"심청이"}=${"홍길동"gt"심청이"}<br>
	&#36;{"홍길동"<="심청이"}=${"홍길동"<="심청이"}<br>
	&#36;{"홍길동"le"심청이"}=${"홍길동"le"심청이"}<br>
	&#36;{"홍길동">="심청이"}=${"홍길동">="심청이"}<br>
	&#36;{"홍길동"ge"심청이"}=${"홍길동"ge"심청이"}<br>
--%>

<%-- 
	&#36;{10>6 && 5==6}=${10>6 && 5==6}<br>
	&#36;{10>6 and 5==6}=${10>6 and 5==6}<br>
	&#36;{10>6 || 5==6}=${10>6 || 5==6}<br>
	&#36;{10>6 or 5==6}=${10>6 or 5==6}<br>
--%>

	&#36;{10>6?"A":"B"}=${10>6?"A":"B"}<%//true면 a출력, false면 b출력 %><br>
</body>
</html>